//XMSG: 1st variable - current step number; 2nd variable - total number of steps.
"BUILDING_ENTITY_STORE"="Performing step %d of %d: Building the entity store";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps.
"CREATING_BOOTSTRAP_DATABASE"="Performing step %d of %d: Creating bootstrap database";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps.
"CREATING_REQUEST_QUEUE_DATABASE"="Performing step %d of %d: Creating request queue database";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps; 3rd variable - received bytes; 4th variable - total bytes.
"DOWNLOADING_ENTITY_STORE"="Performing step %d of %d: Downloading entity store. Received %s of %s so far";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps.
"ERASING_EXPIRED_REQUESTS"="Performing step %d of %d: Erasing expired requests";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps.
"LOADING_METADATA"="Performing step %d of %d: Loading the metadata";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps.
"PERFORMING_REQUEST_QUEUE_MERGE"="Performing step %d of %d: Performing request queue merge";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps.
"PERFORMING_TRANSACTION_MERGE"="Performing step %d of %d: Performing transaction merge";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps.
"PERFORMING_CREATE_DELETE_MERGE"="Performing step %d of %d: Performing create delete merge";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps; 3rd variable - request name; 4th variable - request url.
"PROCESSING_DEFINING_QUERIES"="Performing step %d of %d: Processing defining queries %s using %s";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps; 3rd variable - request number; 4th variable - total request number.
"PROCESSING_REQUESTS"="Performing step %d of %d: Processing requests. Sending modification request %s of %s";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps.
"REAPPLYING_CHANGES"="Performing step %d of %d: Reapplying changes";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps.
"ANALYZING_RECEIVED_DATA"="Performing step %d of %d: Analyzing received data";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps; 3rd variable - received bytes.
"RECEIVING_DATA_FROM_SERVER"="Performing step %d of %d: Receiving data from the server. Received %s so far";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps.
"REMOVING_DELETED_RELATIONSHIPS"="Performing step %d of %d: Removing deleted relationships";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps. Removing requests that have a custom http header "REMOVE_AFTER_UPLOAD". Note: the header name is a constant, please do not translate.
"REMOVING_REMOVEAFTERUPLOAD_REQUESTS"="Performing step %d of %d: Removing requests specified as RemoveAfterUpload";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps; 3rd variable - sent bytes.
"SENDING_DATA_TO_SERVER"="Performing step %d of %d: Sending data to the server. Sent %s so far";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps; 3rd variable - sent bytes; 4th variable - total bytes.
"SENDING_ENTITY_STORE_DATABASE"="Performing step %d of %d: Sending entity store database. Sent %s of %s so far";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps; 3rd variable - sent bytes; 4th variable - total bytes.
"SENDING_REQUEST_QUEUE_DATABASE"="Performing step %d of %d: Sending request queue database. Sent %s of %s so far";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps.
"STARTING_COMMUNICATION_WITH_SERVER"="Performing step %d of %d: Starting communication with the server";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps.
"UPLOAD_PREPROCESSING"="Performing step %d of %d: Pre-processing requests before uploading";

//XMSG: 1st variable - current step number; 2nd variable - total number of steps.
"WAITING_FOR_DOWNLOAD"="Performing step %d of %d: Waiting for download";
